{
  "format": "layers-model",
  "generatedBy": "keras v2.3.0-tf",
  "convertedBy": "TensorFlow.js Converter v2.0.0",
  "modelTopology": {
    "keras_version": "2.3.0-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [null, 128],
              "dtype": "float32",
              "input_dim": 46,
              "output_dim": 32,
              "embeddings_initializer": { "class_name": "RandomUniform", "config": { "minval": -0.05, "maxval": 0.05, "seed": null } },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": true,
              "input_length": 128
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm",
                  "trainable": true,
                  "batch_input_shape": [null, null, 45],
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 64,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } },
                  "recurrent_initializer": { "class_name": "Orthogonal", "config": { "gain": 1.0, "seed": null } },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.1,
                  "recurrent_dropout": 0.3,
                  "implementation": 1
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_1",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_1",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 64,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } },
                  "recurrent_initializer": { "class_name": "Orthogonal", "config": { "gain": 1.0, "seed": null } },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.1,
                  "recurrent_dropout": 0.3,
                  "implementation": 1
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_2",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_2",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 64,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } },
                  "recurrent_initializer": { "class_name": "Orthogonal", "config": { "gain": 1.0, "seed": null } },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.1,
                  "recurrent_dropout": 0.3,
                  "implementation": 1
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_3",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_3",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 64,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } },
                  "recurrent_initializer": { "class_name": "Orthogonal", "config": { "gain": 1.0, "seed": null } },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.1,
                  "recurrent_dropout": 0.3,
                  "implementation": 1
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 17,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [null, 128]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "weighted_metrics": null,
      "loss_weights": null,
      "sample_weight_mode": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "bidirectional/forward_lstm/lstm_cell_1/kernel", "shape": [32, 256], "dtype": "float32" },
        { "name": "bidirectional/forward_lstm/lstm_cell_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32" },
        { "name": "bidirectional/forward_lstm/lstm_cell_1/bias", "shape": [256], "dtype": "float32" },
        { "name": "bidirectional/backward_lstm/lstm_cell_2/kernel", "shape": [32, 256], "dtype": "float32" },
        { "name": "bidirectional/backward_lstm/lstm_cell_2/recurrent_kernel", "shape": [64, 256], "dtype": "float32" },
        { "name": "bidirectional/backward_lstm/lstm_cell_2/bias", "shape": [256], "dtype": "float32" },
        { "name": "bidirectional_1/forward_lstm_1/lstm_cell_4/kernel", "shape": [128, 256], "dtype": "float32" },
        { "name": "bidirectional_1/forward_lstm_1/lstm_cell_4/recurrent_kernel", "shape": [64, 256], "dtype": "float32" },
        { "name": "bidirectional_1/forward_lstm_1/lstm_cell_4/bias", "shape": [256], "dtype": "float32" },
        { "name": "bidirectional_1/backward_lstm_1/lstm_cell_5/kernel", "shape": [128, 256], "dtype": "float32" },
        { "name": "bidirectional_1/backward_lstm_1/lstm_cell_5/recurrent_kernel", "shape": [64, 256], "dtype": "float32" },
        { "name": "bidirectional_1/backward_lstm_1/lstm_cell_5/bias", "shape": [256], "dtype": "float32" },
        { "name": "bidirectional_2/forward_lstm_2/lstm_cell_7/kernel", "shape": [128, 256], "dtype": "float32" },
        { "name": "bidirectional_2/forward_lstm_2/lstm_cell_7/recurrent_kernel", "shape": [64, 256], "dtype": "float32" },
        { "name": "bidirectional_2/forward_lstm_2/lstm_cell_7/bias", "shape": [256], "dtype": "float32" },
        { "name": "bidirectional_2/backward_lstm_2/lstm_cell_8/kernel", "shape": [128, 256], "dtype": "float32" },
        { "name": "bidirectional_2/backward_lstm_2/lstm_cell_8/recurrent_kernel", "shape": [64, 256], "dtype": "float32" },
        { "name": "bidirectional_2/backward_lstm_2/lstm_cell_8/bias", "shape": [256], "dtype": "float32" },
        { "name": "bidirectional_3/forward_lstm_3/lstm_cell_10/kernel", "shape": [128, 256], "dtype": "float32" },
        { "name": "bidirectional_3/forward_lstm_3/lstm_cell_10/recurrent_kernel", "shape": [64, 256], "dtype": "float32" },
        { "name": "bidirectional_3/forward_lstm_3/lstm_cell_10/bias", "shape": [256], "dtype": "float32" },
        { "name": "bidirectional_3/backward_lstm_3/lstm_cell_11/kernel", "shape": [128, 256], "dtype": "float32" },
        { "name": "bidirectional_3/backward_lstm_3/lstm_cell_11/recurrent_kernel", "shape": [64, 256], "dtype": "float32" },
        { "name": "bidirectional_3/backward_lstm_3/lstm_cell_11/bias", "shape": [256], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [128, 17], "dtype": "float32" },
        { "name": "dense/bias", "shape": [17], "dtype": "float32" },
        { "name": "embedding/embeddings", "shape": [46, 32], "dtype": "float32" }
      ]
    }
  ]
}
